# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

# ------------------------------------------------------------------------------
# Command line interface from brew
# ------------------------------------------------------------------------------

# Install ZSH
brew 'zsh'
brew 'starship' # pure vs starship? lets see

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Install Binaries
brew 'ack' # Better Search
brew 'dark-mode' #Toggle Dark Mode from CLI
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'tree'
brew 'wget'


# Node
brew 'node'
brew 'nvm'
brew 'yarn'

# karabiner elements https://github.com/yqrashawn/GokuRakuJoudo
brew 'yqrashawn/goku/goku'

#
brew 'pick'

# ------------------------------------------------------------------------------
# Applications from brew cask
# ------------------------------------------------------------------------------

# Install GNU core utilities (those that come with macOS are outdated)
# Install some other useful utilities like `sponge`.
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Editors + git + code related stuff
cask 'github'
cask 'fork'
cask 'visual-studio-code'
cask 'hyper'
cask 'iterm2'
cask 'insomnia'
cask 'postman'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack'

# Browsers and drives
cask 'google-chrome'
# google drive:
cask 'google-backup-and-sync'
cask 'firefox'

# Utils
cask 'avibrazil-rdm'
cask 'caffeine'
cask 'spectacle'
cask 'hyperswitch'
cask 'the-unarchiver'
cask 'karabiner-elements'
cask 'raycast'

# Others
cask 'notion'
cask 'boostnote'
cask 'numi'
cask 'kap'
cask 'iina'
cask 'vlc'
cask 'sip'
cask 'monitorcontrol'

cask 'docker'
cask 'spotify'
cask 'discord'
cask 'pennywise'

# DB Tools
# cask 'sequel-pro'
# cask 'skype'
