# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/fonts'

# ------------------------------------------------------------------------------
# Command line interface from brew
# ------------------------------------------------------------------------------

# Install ZSH
brew 'zsh'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Install Binaries
brew 'ack' # Better Search
brew 'dark-mode' #Toggle Dark Mode from CLI
brew 'git'
brew 'git-lfs'
brew 'tree'
brew 'wget'


# Node
brew 'node'
brew 'nvm'
brew 'yarn'

brew 'hub'

# ------------------------------------------------------------------------------
# Applications from brew cask
# ------------------------------------------------------------------------------

# Install GNU core utilities (those that come with macOS are outdated)
# Install some other useful utilities like `sponge`.
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Editors and git management
cask 'github'
cask 'visual-studio-code'
cask 'hyper'
cask 'iterm2'
cask 'insomnia'

# Fonts
cask 'font-fira-code'
cask 'font-hack'

# Browsers and drives
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'firefox'

# Utils
cask 'avibrazil-rdm'
cask 'caffeine'
cask 'spectacle'
cask 'hyperswitch'
cask 'the-unarchiver'

# Others
cask 'franz'
cask 'boostnote'
cask 'numi'
cask 'kap'
cask 'iina'
cask 'pophub'
cask 'sip'

# DB Tools
# cask 'sequel-pro'

# TODO
# cask 'docker'
# cask 'spotify'
# cask 'vlc'
# cask 'skype'
