# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/services'

# ------------------------------------------------------------------------------
# Command line interface from brew
# ------------------------------------------------------------------------------

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Node
brew 'node'
brew 'nvm'
brew 'yarn'

# ------------------------------------------------------------------------------
# Applications from brew cask
# ------------------------------------------------------------------------------

# Editors and git management
cask 'hub'
cask 'github'
cask 'visual-studio-code'
cask 'hyper'
cask 'iterm2'
cask 'insomnia'

# Browsers and drives
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'firefox'

# Utils
cask 'avibrazil-rdm'
cask 'caffeine'
cask 'spectacle'
cask 'hyperswitch'
cask 'the-unarchiver'

# Others
cask 'franz'
cask 'boostnote'
cask 'pophub'
cask 'numi'
cask 'sip'
cask 'kap'
cask 'iina'
cask 'astro'

# DB Tools
# cask 'sequel-pro'

# TODO
# cask 'docker'
# cask 'spotify'
# cask 'vlc'
# cask 'skype'
